In [1]:
# https://docs.mongodb.com/manual/reference/operator/query/

'''
1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.
2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.
3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.
4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.
5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.
6. All the companies that don't include the partners field.
7. All the companies that have a null type of value on the category_code field.
8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.
9. Order all the companies by their IPO price descendently.
10. Retrieve the 10 companies with more employees, order by the number of employees
11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.
12. All the companies that have been 'deadpooled' after the third year.
13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000
14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.
15. Order the companies by their founded year, retrieving only their name and founded year.
16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their aquisition price descendently. Limit the search to 10 documents.
17. All the companies on the 'web' category that have more than 4000 employees. Sort them by the amount of employees in ascendant order.
18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.
19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their name and acquisition fields.
20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.


from pymongo import MongoClient 
client = MongoClient("mongodb://admin:admin@localhost:32768")
db = client.mybbdd
docs = db.docs.find({"founded_year":{"$gte":2010}})
print(len(list(docs)))

'''
pass

In [2]:
# https://docs.mongodb.com/manual/reference/operator/query/
from pymongo import MongoClient
import pymongo
import pandas as pd
from pandas.io.json import json_normalize

In [3]:
client = MongoClient("mongodb://admin:admin@localhost:32769")
db = client.mybbdd

In [4]:
# docs = db.docs.find({"founded_year":{"$gte":2010}})
# print(len(list(docs)))

1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.

In [5]:
# name
companies1 = db.docs.find({"name":{"$eq":"Babelgum"}}, { "name": 1 , "_id": 0})
df1 = pd.DataFrame(list(companies1))
df1.head()

       name
0  Babelgum

2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.

In [6]:
# number_of_employees
companies2 = db.docs.find({"number_of_employees":{"$gt":5000}}, 
                          limit=20, 
                          projection={ "name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)
df2 = pd.DataFrame(list(companies2))
print(len(df2))
df2

20

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.

In [7]:
# founded_year
companies3 = db.docs.find({"founded_year":{"$gte":2000, "$lte":2005}}, 
                          projection={"name": 1 , "founded_year": 1, "_id": 0})

d = list(companies3)
df3 = pd.DataFrame(d)
print(len(df3))
df3.head(10)

3734

   founded_year         name
0          2005         Zoho
1          2004         Digg
2          2005    Omnidrive
3          2005     Wetpaint
4          2002  StumbleUpon
5          2003       Gizmoz
6          2005        Helio
7          2004     Facebook
8          2002        Plaxo
9          2002   Technorati

4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.

In [8]:
# Valuation Amount
# hay que buscar ipo en compass
companies4 = db.docs.find({"founded_year":{"$lt":2010}, "ipo.valuation_amount": {"$gte": 100000000}}, 
                          projection={"name": 1 , "ipo.valuation_amount": 1, "_id": 0})


d = list(companies4)

# pd4 = json_normalize((list(doc4)))

df4 = pd.DataFrame(d)
# print(len(df4))
df4['ipo'] = json_normalize(df4['ipo'])

df4.head(10)

            ipo            name
0  104000000000        Facebook
1   18100000000         Twitter
2    1300000000            Yelp
3    9310000000        LinkedIn
4     290000000      Brightcove
5  100000000000          Amazon
6     235000000     KIT digital
7    1600000000         Nielsen
8    1050000000       OpenTable
9     287000000  ChannelAdvisor

5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [9]:
# number_of_employees
companies5 = db.docs.find({"number_of_employees":{"$lt":1000}, "founded_year": {"$lt": 2005}}, 
                          limit=10, 
                          projection={"name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)

d = list(companies5)
df5 = pd.DataFrame(d)
df5

                              name  number_of_employees
0             Infinera Corporation                  974
1  NorthPoint Communications Group                  948
2                     888 Holdings                  931
3               Forrester Research                  903
4                        SonicWALL                  900
5                       Webmetrics                  900
6             Cornerstone OnDemand                  881
7                             Yelp                  800
8                         ZoomInfo                  800
9                          MySpace                  800

6. All the companies that don't include the partners field.

In [10]:
# not partners field

# doc7 = coll.find({“category_code”: {“$type”:10}},projection={“name”:1,“_id”:0})

companies6 = db.docs.find({"partners":{"$type":10}}, 
                          # limit=10, 
                          projection={"name": 1, "_id": 0})

d = companies6
# df6 = pd.DataFrame(d)
# df6
print(len(list(d)))

# Todos tienen campo partners

0

7. All the companies that have a null type of value on the category_code field.

In [11]:
# not category_code field

# otra forma: doc7 = coll.find({“category_code”: {“$type”:10}},projection={“name”:1,“_id”:0})
# type 10 hace referencia a los null

companies7 = db.docs.find({"category_code":{"$eq":None}}, 
                          # limit=10, 
                          projection={"name": 1, "_id": 0})

d = companies7
# df7 = pd.DataFrame(d)
# df7
print(len(list(d)))

2751

8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.

In [12]:
# not category_code field
companies8 = db.docs.find({"number_of_employees":{"$gt":100, "$lt": 1000}}, 
                          # limit=10, 
                          projection={"name": 1, "number_of_employees": 1, "_id": 0})

# df7 = pd.DataFrame(d)
# df7
d = list(companies8)
print(len(d))
df8 = pd.DataFrame(d)
df8.head()

753

        name  number_of_employees
0  AdventNet                  600
1    AddThis                  120
2      OpenX                  305
3   LifeLock                  644
4      Jajah                  110

9. Order all the companies by their IPO price descendently.

In [13]:
### no sale

'''
doc9 = coll.find({"ipo.valuation_amount":{"$ne":None}},projection={"name":1,"ipo.valuation_amount":1,"_id":0}).sort("ipo.valuation_amount",pymongo.DESCENDING)
'''


companies9 = db.docs.find({"ipo.valuation_amount":{"$ne":None}},
                          projection={"name":1,"ipo.valuation_amount":1,"_id":0}).sort("ipo.valuation_amount",pymongo.DESCENDING)

# df7 = pd.DataFrame(d)
# df7
d = list(companies9)
print(len(d))
df9 = pd.DataFrame(d)
df9['ipo'] = json_normalize(df9['ipo'])

df9.head()

61

            ipo      name
0  108960000000      GREE
1  104000000000  Facebook
2  100000000000    Amazon
3   18100000000   Twitter
4   12800000000   Groupon

10. Retrieve the 10 companies with more employees, order by the number of employees

In [14]:
# number_of_employees
companies10 = db.docs.find( 
                          limit=10, 
                          projection={"name": 1, "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)

d = list(companies10)
df10 = pd.DataFrame(d)
df10

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [15]:
# founded_month
companies11 = db.docs.find( {"founded_month": {"$in": [7, 8, 9, 10, 11, 12]}}, 
                          limit=1000, 
                          projection={"name": 1, "_id": 0})

d = list(companies11)
df11 = pd.DataFrame(d)
df11.head(20)

               name
0              Zoho
1              Digg
2         Omnidrive
3          Wetpaint
4             Joost
5             Plaxo
6              eBay
7          Powerset
8              Kyte
9             Thoof
10  Jingle Networks
11         LifeLock
12           Wesabe
13          SmugMug
14            Skype
15   Pando Networks
16             Ikan
17        delicious
18         AllPeers
19             Wize

12. All the companies that have been 'deadpooled' after the third year.

In [16]:
# deadpooled

# no sale 


companies12 = db.docs.find( # { $subtract: [ "deadpooled_year", "founded_year" ] }, 
                            {"deadpooled_year":{"$gte":3, "$lt": 1000}}, 
                          limit=10, 
                          projection={"name": 1, "deadpooled_year": 1, "_id": 0})

d = list(companies12)
df12 = pd.DataFrame(d)
df12.head(20)

   deadpooled_year  name
0                3  Zoho

13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000

In [17]:
# founded 

# {"founded_year":{"$lt":2010}, "ipo.valuation_amount": {"$gte": 100000000}}

companies13 = db.docs.find( {"founded_year":{"$lt":2000},  
                             "acquisition.price_amount": {"$gt": 10000000}}, 
                           projection={"name": 1, "founded_year": 1, "acquisition.price_amount": 1, "_id": 0})

d = list(companies13)

# json_normalize(d['programs'])

df13 = pd.DataFrame(d)
df13['acquisition'] = json_normalize(df13['acquisition'])
df13

     acquisition  founded_year                            name
0      625000000          1999                         Postini
1      180000000          1999                        SideStep
2       25000000          1999                      Recipezaar
3     1500000000          1998                          PayPal
4      300000000          1999                        Snapfish
5      160000000          1999                         Neopets
6     7400000000          1982                Sun Microsystems
7     1200000000          1999                          Zappos
8     1000000000          1999                         Alibaba
9     1008000000          1998                      Lastminute
10    4300000000          1960                           Sabre
11      64000000          1994                      Sportsline
12      71000000          1995                        Webshots
13      11600000          1999                            MIVA
14    1300000000          1980                         Digitas
15     600000000          1995                        iVillage
16     485000000          1999                    PriceGrabber
17      18400000          1999                         Kaboose
18     425000000          1996                       LinkShare
19     132000000          1998                       Fastclick
20     871000000          1999                          Eloqua
21     775000000          1995                      Interwoven
22    1800000000          1996                        Omniture
23     250000000          1999                   HowStuffWorks
24     100000000          1994                         RealAge
25      50000000          1995                           Match
26      30000000          1999                          Xdrive
27     250000000          1996                           Alexa
28      65000000          1996                     Offermatica
29      91400000          1996                            ioko
..           ...           ...                             ...
175     24820000          1998                  Digital Forest
176     13450000          1993                Connect3 Systems
177    105000000          1979                  Tidal Software
178     53000000          1999                       AppStream
179     71000000          1987  Enliven Marketing Technologies
180     73300000          1990                       NetManage
181     87110000          1991          Integration Associates
182    830000000          1985                          Sophos
183    249000000          1990                       HireRight
184    290000000          1986                 Photon Dynamics
185    300000000          1993           NetCracker Technology
186    471390000          1999                NuTech Solutions
187    720000000          1968          Metrologic Instruments
188    180000000          1986              Sierra Monolithics
189     30000000          1945               Veeco Instruments
190    552000000          1998                        Lightera
191    300000000          1997                       NetScaler
192    106140000          1985         Catapult Communications
193     10500000          1997                       Easyspace
194     15000000          1999                  Iron Solutions
195     18000000          1999                        Bookrags
196     29350000          1989                    Muniservices
197     28000000          1981            Aleri Global Banking
198    356000000          1998                       AuthenTec
199   1400000000          1969                       Vertafore
200     30000000          1993            Inventa Technologies
201     49000000          1994                         Savvion
202     23200000          1998             Universal Microwave
203     18780000          1982     Advanced Control Components
204     15040000          1974  Contemporary Computer Services

[205 rows x 3 columns]

14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.

In [18]:
# adquired 2015 

# Cambiamos los datos de 2015 -> 2010
companies14 = db.docs.find( {"acquisition.acquired_year": {"$gt": 2010}}, 
                           projection={"name": 1, "acquisition.price_amount": 1, "_id": 0}).sort("acquisition.price_amount", pymongo.DESCENDING)

d = list(companies14)
print(len(d))

df14 = pd.DataFrame(d)
df14['acquisition'] = json_normalize(df14['acquisition'])
df14.head()

736

    acquisition                    name
0  3.900000e+10                T-Mobile
1  1.840000e+10    Goodrich Corporation
2  6.600000e+09                     LSI
3  6.500000e+09  National Semiconductor
4  4.300000e+09                   Ariba

15. Order the companies by their founded year, retrieving only their name and founded year.

In [19]:
# founded year

companies15 = db.docs.find(limit=1000, 
                           projection={"name": 1, "founded_year": 1, "_id": 0}).sort("founded_year", pymongo.DESCENDING)

d = list(companies15)
print(len(d))

df15 = pd.DataFrame(d)
# df15['acquisition'] = json_normalize(df15['acquisition'])
df15.head(15)

1000

    founded_year                   name
0           2013                  Fixya
1           2013                  Wamba
2           2013              Advaliant
3           2013                   Fluc
4           2013                 iBazar
5           2013                 Gimigo
6           2013               SEOGroup
7           2013                 Clowdy
8           2013               WhosCall
9           2013                   Pikk
10          2013                Tongxue
11          2013               Shopseen
12          2013  VistaGen Therapeutics
13          2012                PeekYou
14          2012                  headr

16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their aquisition price descendently. Limit the search to 10 documents.

In [20]:
# founded year

companies16 = db.docs.find({"founded_day": {"$in": [1,2,3,4,5,6,7]}}, 
                           limit=10, 
                           projection={"name": 1,"_id": 0}).sort("acquisition.price_amount", pymongo.DESCENDING)

d = list(companies16)
print(len(d))

df16 = pd.DataFrame(d)
# df15['acquisition'] = json_normalize(df15['acquisition'])
df16

10

                name
0           Netscape
1             PayPal
2             Zappos
3            Alibaba
4            Postini
5             Danger
6  Clearwell Systems
7         PrimeSense
8             Amobee
9        BlueLithium

17. All the companies on the 'web' category that have more than 4000 employees. Sort them by the amount of employees in ascendant order.

In [21]:
# web

companies17 = db.docs.find({"number_of_employees":{"$gt":4000}, 
                            "category_code": {"$eq": "web"}}, 
                           projection={"name": 1, "number_of_employees": 1, "_id": 0}).sort("number_of_employees", pymongo.DESCENDING)

d = list(companies17)
print(len(d))

df17 = pd.DataFrame(d)
# df15['acquisition'] = json_normalize(df15['acquisition'])
df17

9

                            name  number_of_employees
0                       Experian                15500
1                           eBay                15000
2                         Yahoo!                13600
3                        Rakuten                10000
4  Los Angeles Times Media Group                10000
5                        Groupon                10000
6                        Webkinz                 8657
7                            AOL                 8000
8                        Expedia                 4400

18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.

In [22]:
# EUR

companies18 = db.docs.find({"acquisition.price_amount":{"$gt":10000000}, 
                            "acquisition.price_currency_code": {"$eq": "EUR"}}, 
                           projection={"name": 1, "_id": 0})

d = list(companies18)
print(len(d))

df18 = pd.DataFrame(d)
# df15['acquisition'] = json_normalize(df15['acquisition'])
df18

7

                  name
0                  ZYB
1              Apertio
2    Greenfield Online
3              Webedia
4            Wayfinder
5  Tuenti Technologies
6       BioMed Central

19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their name and acquisition fields.

In [23]:
# trimester

companies19 = db.docs.find({"acquisition.acquired_month":{"$in":[1,2,3]}}, 
                           limit = 10, 
                           projection={"name": 1, "acquisition": 1, "_id": 0})

d = list(companies19)
print(len(d))

df19 = pd.DataFrame(d)
# df19['acquisition'] = json_normalize(df19['acquisition'])
df19

10

                                         acquisition         name
0  {'price_amount': None, 'price_currency_code': ...         Kyte
1  {'price_amount': 327000000, 'price_currency_co...   NetRatings
2  {'price_amount': None, 'price_currency_code': ...       blogTV
3  {'price_amount': None, 'price_currency_code': ...   Livestream
4  {'price_amount': 169000000, 'price_currency_co...     iContact
5  {'price_amount': 168000000, 'price_currency_co...  Dailymotion
6  {'price_amount': None, 'price_currency_code': ...      Coghead
7  {'price_amount': None, 'price_currency_code': ...     Netvibes
8  {'price_amount': None, 'price_currency_code': ...       Flickr
9  {'price_amount': None, 'price_currency_code': ...   BabyCenter

20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [24]:
# founded adquired

# field: { $not: { <operator-expression> } }

companies20 = db.docs.find({"founded_year": {"$gte": 2000, "$lte": 2010}, 
                            "acquisition.acquired_year":{"$not":{"$lt": 2011} }}, 
                           projection={"name": 1, "founded_year": 1, "acquisition.acquired_year": 1, "_id": 0})

d = list(companies20)
print(len(d))

df20 = pd.DataFrame(d)
# df19['acquisition'] = json_normalize(df19['acquisition'])
df20

9943

                  acquisition  founded_year                     name
0                         NaN          2005                     Zoho
1     {'acquired_year': 2012}          2004                     Digg
2                         NaN          2005                Omnidrive
3     {'acquired_year': 2012}          2006                     Geni
4     {'acquired_year': 2013}          2005                 Wetpaint
5                         NaN          2006                  Slacker
6                         NaN          2007                   Scribd
7                         NaN          2007                  MeetMoi
8                         NaN          2004                 Facebook
9                         NaN          2006                  Twitter
10                        NaN          2007                 Babelgum
11                        NaN          2002               Technorati
12                        NaN          2004                  AddThis
13                        NaN          2008                    OpenX
14                        NaN          2007                  Sparter
15                        NaN          2007                   Mahalo
16    {'acquired_year': 2011}          2006                     Kyte
17                        NaN          2006                    Thoof
18    {'acquired_year': 2011}          2005          Jingle Networks
19                        NaN          2005                 LifeLock
20                        NaN          2005                   Wesabe
21                        NaN          2005                Jangl SMS
22                        NaN          2002                  SmugMug
23                        NaN          2002                   Meetup
24                        NaN          2006                  Prosper
25                        NaN          2006                  Stickam
26    {'acquired_year': 2013}          2006                   blogTV
27                        NaN          2007                  Ustream
28                        NaN          2007             AdaptiveBlue
29                        NaN          2004           Pando Networks
...                       ...           ...                      ...
9913                      NaN          2007              My TV Shows
9914  {'acquired_year': 2013}          2002          Luminus Devices
9915                      NaN          2009              ConvoCreatr
9916                      NaN          2008               Hellocoton
9917                      NaN          2004               AwardSpace
9918                      NaN          2008          Knowledge Genes
9919                      NaN          2008                Buddhacom
9920                      NaN          2006                   Nokaut
9921                      NaN          2006               ugandasoft
9922                      NaN          2000                  Netrake
9923                      NaN          2009                 Gambolio
9924                      NaN          2006             Kicker Films
9925                      NaN          2004                 NextLabs
9926                      NaN          2009                 SEO Sumo
9927                      NaN          2009                 InstantQ
9928                      NaN          2008                 iGuiders
9929                      NaN          2009                acrossair
9930                      NaN          2001           Cameron Health
9931                      NaN          2006                 Cantimer
9932  {'acquired_year': 2011}          2004  Celestial Semiconductor
9933  {'acquired_year': 2011}          2009                MyChances
9934                      NaN          2008            Constant Wave
9935                      NaN          2009                   Getyoo
9936                      NaN          2009        OfficialVirtualDJ
9937                      NaN          2008                 cotralis
9938                      NaN          2004           Axon Solutions
9939                      NaN          2006               Eazeeloans
9940                      NaN          2009                   Adhunk
9941                      NaN          2002               AfterLogic
9942                      NaN          2009                   Oriact

[9943 rows x 3 columns]